{
    "profile": "Дмитро Копань",
    "skills": "Навики",
    "experience": "Досвід",
    "projects": "Проекти",
    "education": "Освіта",
    "spokenLanguages": "Мова спалкування",
    "jobTitle": "Java Software Engineer",
    "contact": "Контактна інформація",
    "profileContent": "Java Software Engineer з 5+ роками досвіду розробки масштабованих хмарних додатків і мікросервісів. Володію Java, Spring Framework і сучасними методами розробки програмного забезпечення (CI/CD, TDD, BDD). Досвід створення кластеризованих хмарних рішень із практичним досвідом роботи з Apache Spark для потокової агрегації з Kafka. Володію такими інструментами контейнеризації, як Docker, що забезпечує безпроблемне розгортання та масштабованість. Маю досвід автоматизованого тестування за допомогою Cucumber, і розгортання за допомогою Tilt, що забезпечує надійне та високоякісне програмне забезпечення. Командний гравець, який успішно працює в гнучкому середовищі, готовий впроваджувати інновації та надавати ефективні рішення.",
    "skillsList": [
      "Java",
      "Spring Boot",
      "Hibernate",
      "SQL",
      "Git",
      "Docker",
      "K8s",
      "Helm",
      "Agile",
      "Spark",
      "Tilt",
      "Cucumber",
      "Shell scripting",
      "Python"
    ],
    "experiencesContent": [
      {
        "title": "<strong>Software Engineer</strong> - Ericsson Hungary Kft., Budapest, Hungary<br>2022 March - 2024 October",
        "description": "<li>Розробка та підтримка хмарних застосунків Java для агрегації ключових показників ефективності телекомунікацій</li><li>Співпраця з міжфункціональними командами для забезпечення своєчасного виконання ключових проектів</li><li>Забезпечення рівня безпеки та відповідності</li ><li>Автоматизація керування звітами про вразливості та створення тікетів Jira</li><li>Оцінка ризиків уразливостей</li><li>Інтеграція з керуванням життєвим циклом проекту рамка</li>"
      },
      {
        "title":"<strong>Software Developer</strong> - Capsys Ltd., Budapest, Hungary<br>2019 August - 2022 February",
        "description":"<li>Розробляв функції та полегшав застарілі фреймворки у фінтех</li><li>Розробляв та впроваджував надійну систему узгодження даних, щоб забезпечити точність, послідовність і цілісність фінансових операцій у негайних платежах у екосистемі фінтех.</li> li><li>Забезпечення відповідності вимогам FinTech для 99,999% успішних транзакцій</li><li>Оптимізація специфікацію шляхом її реструктуризації для покращення читабельності та повторного використання</li>"
      }
    ],
    "projectsList": [
      {
        "title": "Stream Aggregator",
        "description": "Сервіс на основі Spark, призначений для обробки та перетворення потокових даних. Система отримує дані з Apache Kafka як джерела вхідних даних, виконує обробку майже в реальному часі та виводить результати назад у Kafka. Все рішення працює в рамках кластерної архітектури мікросервісів, що забезпечує масштабованість, відмовостійкість і високу доступність. Крім того, додаток інтегровано з Prometheus для моніторингу та спостереження. Відображаються показники, пов’язані з продуктивністю, використанням ресурсів і конвеєрами обробки, що забезпечує бездоганну інтеграцію з ширшою екосистемою моніторингу."
      },
      {
        "title": "Custom Spotfire JDBC Driver",
        "description": "Розроблена спеціальна реалізація інтерфейсу SQL для підключення сервера Spotfire та OData RestAPI хмарної сервісу."
      },
      {
        "title": "Service mesh integration with ISTIO",
        "description": "Інтегровано систему ISTIO в існуючий кластеризований сервіс. Візуалізований зв'язок між мікросервісами. Покращено безпеку служби шляхом контролю вихідного трафіку (заборона зловмисному програмному забезпеченню завантажувати зовнішні ресурси) і безпеки зв’язку між мікросервісами (mTLS).."
      },
      {
        "title": "REST API OpenAPI yaml specification",
        "description": "Проаналізовано та оптимізовано структуру специфікації OpenAPI 3 YAML. Розкладений моноліт YAML на кілька логічно розділених фрагментів, покращена читабельність і швидкість впровадження нових функцій."
      },
      {
        "title": "Calypso framework facilitation",
        "description": "Зміна моделі даних для включення нових стовпців із посиланням на специфікації застарілої системи"
      },
      {
        "title": "Data reconciliation",
        "description": "Проект SQL на основі Microsoft Access. Об'єднання та фільтрація таблиць зі зведенням для демонстрації даних"
      },
      {
        "title": "Immediate Payments",
        "description": "Інтеграція та адаптація універсальних платежів ACI для негайних платежів. Надання підтримки на місці для налаштування та тестування."
      }
    ],
    "educationContent": [
      "<strong>Інженер дослідник (Магістр)</strong> - Національний Технічний Університет України (2010–2012)",
      "<strong>Інженер механік (Бакалавр)</strong> - Національний Технічний Університет України (2006-2010)"
    ],
    "languagesList": [
      "Українська (рідна)",
      "Англійська (розмовна)"
    ]
  }